espressif/esp-idf/components/soc/esp32p4/include/soc/iomux_reg.h
/** IO_MUX_gpio29_REG register
 *  iomux control register for gpio29
 */
#define IO_MUX_GPIO29_REG (DR_REG_IO_MUX_BASE + 0x78)
/** IO_MUX_GPIO29_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO29_MCU_OE    (BIT(0))
#define IO_MUX_GPIO29_MCU_OE_M  (IO_MUX_GPIO29_MCU_OE_V << IO_MUX_GPIO29_MCU_OE_S)
#define IO_MUX_GPIO29_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO29_MCU_OE_S  0
/** IO_MUX_GPIO29_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO29_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO29_SLP_SEL_M  (IO_MUX_GPIO29_SLP_SEL_V << IO_MUX_GPIO29_SLP_SEL_S)
#define IO_MUX_GPIO29_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO29_SLP_SEL_S  1
/** IO_MUX_GPIO29_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO29_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO29_MCU_WPD_M  (IO_MUX_GPIO29_MCU_WPD_V << IO_MUX_GPIO29_MCU_WPD_S)
#define IO_MUX_GPIO29_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO29_MCU_WPD_S  2
/** IO_MUX_GPIO29_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO29_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO29_MCU_WPU_M  (IO_MUX_GPIO29_MCU_WPU_V << IO_MUX_GPIO29_MCU_WPU_S)
#define IO_MUX_GPIO29_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO29_MCU_WPU_S  3
/** IO_MUX_GPIO29_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO29_MCU_IE    (BIT(4))
#define IO_MUX_GPIO29_MCU_IE_M  (IO_MUX_GPIO29_MCU_IE_V << IO_MUX_GPIO29_MCU_IE_S)
#define IO_MUX_GPIO29_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO29_MCU_IE_S  4
/** IO_MUX_GPIO29_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strenth on sleep mode
 */
#define IO_MUX_GPIO29_MCU_DRV    0x00000003U
#define IO_MUX_GPIO29_MCU_DRV_M  (IO_MUX_GPIO29_MCU_DRV_V << IO_MUX_GPIO29_MCU_DRV_S)
#define IO_MUX_GPIO29_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO29_MCU_DRV_S  5
/** IO_MUX_GPIO29_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO29_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO29_FUN_WPD_M  (IO_MUX_GPIO29_FUN_WPD_V << IO_MUX_GPIO29_FUN_WPD_S)
#define IO_MUX_GPIO29_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO29_FUN_WPD_S  7
/** IO_MUX_GPIO29_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO29_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO29_FUN_WPU_M  (IO_MUX_GPIO29_FUN_WPU_V << IO_MUX_GPIO29_FUN_WPU_S)
#define IO_MUX_GPIO29_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO29_FUN_WPU_S  8
/** IO_MUX_GPIO29_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO29_FUN_IE    (BIT(9))
#define IO_MUX_GPIO29_FUN_IE_M  (IO_MUX_GPIO29_FUN_IE_V << IO_MUX_GPIO29_FUN_IE_S)
#define IO_MUX_GPIO29_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO29_FUN_IE_S  9
/** IO_MUX_GPIO29_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO29_FUN_DRV    0x00000003U
#define IO_MUX_GPIO29_FUN_DRV_M  (IO_MUX_GPIO29_FUN_DRV_V << IO_MUX_GPIO29_FUN_DRV_S)
#define IO_MUX_GPIO29_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO29_FUN_DRV_S  10
/** IO_MUX_GPIO29_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO29_MCU_SEL    0x00000007U
#define IO_MUX_GPIO29_MCU_SEL_M  (IO_MUX_GPIO29_MCU_SEL_V << IO_MUX_GPIO29_MCU_SEL_S)
#define IO_MUX_GPIO29_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO29_MCU_SEL_S  12
/** IO_MUX_GPIO29_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO29_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO29_FILTER_EN_M  (IO_MUX_GPIO29_FILTER_EN_V << IO_MUX_GPIO29_FILTER_EN_S)
#define IO_MUX_GPIO29_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO29_FILTER_EN_S  15

/** IO_MUX_gpio30_REG register
 *  iomux control register for gpio30
 */
#define IO_MUX_GPIO30_REG (DR_REG_IO_MUX_BASE + 0x7c)
/** IO_MUX_GPIO30_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO30_MCU_OE    (BIT(0))
#define IO_MUX_GPIO30_MCU_OE_M  (IO_MUX_GPIO30_MCU_OE_V << IO_MUX_GPIO30_MCU_OE_S)
#define IO_MUX_GPIO30_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO30_MCU_OE_S  0
/** IO_MUX_GPIO30_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO30_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO30_SLP_SEL_M  (IO_MUX_GPIO30_SLP_SEL_V << IO_MUX_GPIO30_SLP_SEL_S)
#define IO_MUX_GPIO30_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO30_SLP_SEL_S  1
/** IO_MUX_GPIO30_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO30_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO30_MCU_WPD_M  (IO_MUX_GPIO30_MCU_WPD_V << IO_MUX_GPIO30_MCU_WPD_S)
#define IO_MUX_GPIO30_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO30_MCU_WPD_S  2
/** IO_MUX_GPIO30_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO30_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO30_MCU_WPU_M  (IO_MUX_GPIO30_MCU_WPU_V << IO_MUX_GPIO30_MCU_WPU_S)
#define IO_MUX_GPIO30_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO30_MCU_WPU_S  3
/** IO_MUX_GPIO30_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO30_MCU_IE    (BIT(4))
#define IO_MUX_GPIO30_MCU_IE_M  (IO_MUX_GPIO30_MCU_IE_V << IO_MUX_GPIO30_MCU_IE_S)
#define IO_MUX_GPIO30_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO30_MCU_IE_S  4
/** IO_MUX_GPIO30_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strenth on sleep mode
 */
#define IO_MUX_GPIO30_MCU_DRV    0x00000003U
#define IO_MUX_GPIO30_MCU_DRV_M  (IO_MUX_GPIO30_MCU_DRV_V << IO_MUX_GPIO30_MCU_DRV_S)
#define IO_MUX_GPIO30_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO30_MCU_DRV_S  5
/** IO_MUX_GPIO30_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO30_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO30_FUN_WPD_M  (IO_MUX_GPIO30_FUN_WPD_V << IO_MUX_GPIO30_FUN_WPD_S)
#define IO_MUX_GPIO30_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO30_FUN_WPD_S  7
/** IO_MUX_GPIO30_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO30_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO30_FUN_WPU_M  (IO_MUX_GPIO30_FUN_WPU_V << IO_MUX_GPIO30_FUN_WPU_S)
#define IO_MUX_GPIO30_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO30_FUN_WPU_S  8
/** IO_MUX_GPIO30_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO30_FUN_IE    (BIT(9))
#define IO_MUX_GPIO30_FUN_IE_M  (IO_MUX_GPIO30_FUN_IE_V << IO_MUX_GPIO30_FUN_IE_S)
#define IO_MUX_GPIO30_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO30_FUN_IE_S  9
/** IO_MUX_GPIO30_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO30_FUN_DRV    0x00000003U
#define IO_MUX_GPIO30_FUN_DRV_M  (IO_MUX_GPIO30_FUN_DRV_V << IO_MUX_GPIO30_FUN_DRV_S)
#define IO_MUX_GPIO30_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO30_FUN_DRV_S  10
/** IO_MUX_GPIO30_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO30_MCU_SEL    0x00000007U
#define IO_MUX_GPIO30_MCU_SEL_M  (IO_MUX_GPIO30_MCU_SEL_V << IO_MUX_GPIO30_MCU_SEL_S)
#define IO_MUX_GPIO30_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO30_MCU_SEL_S  12
/** IO_MUX_GPIO30_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO30_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO30_FILTER_EN_M  (IO_MUX_GPIO30_FILTER_EN_V << IO_MUX_GPIO30_FILTER_EN_S)
#define IO_MUX_GPIO30_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO30_FILTER_EN_S  15

/** IO_MUX_gpio31_REG register
 *  iomux control register for gpio31
 */
#define IO_MUX_GPIO31_REG (DR_REG_IO_MUX_BASE + 0x80)
/** IO_MUX_GPIO31_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO31_MCU_OE    (BIT(0))
#define IO_MUX_GPIO31_MCU_OE_M  (IO_MUX_GPIO31_MCU_OE_V << IO_MUX_GPIO31_MCU_OE_S)
#define IO_MUX_GPIO31_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO31_MCU_OE_S  0
/** IO_MUX_GPIO31_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO31_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO31_SLP_SEL_M  (IO_MUX_GPIO31_SLP_SEL_V << IO_MUX_GPIO31_SLP_SEL_S)
#define IO_MUX_GPIO31_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO31_SLP_SEL_S  1
/** IO_MUX_GPIO31_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO31_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO31_MCU_WPD_M  (IO_MUX_GPIO31_MCU_WPD_V << IO_MUX_GPIO31_MCU_WPD_S)
#define IO_MUX_GPIO31_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO31_MCU_WPD_S  2
/** IO_MUX_GPIO31_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO31_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO31_MCU_WPU_M  (IO_MUX_GPIO31_MCU_WPU_V << IO_MUX_GPIO31_MCU_WPU_S)
#define IO_MUX_GPIO31_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO31_MCU_WPU_S  3
/** IO_MUX_GPIO31_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO31_MCU_IE    (BIT(4))
#define IO_MUX_GPIO31_MCU_IE_M  (IO_MUX_GPIO31_MCU_IE_V << IO_MUX_GPIO31_MCU_IE_S)
#define IO_MUX_GPIO31_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO31_MCU_IE_S  4
/** IO_MUX_GPIO31_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strenth on sleep mode
 */
#define IO_MUX_GPIO31_MCU_DRV    0x00000003U
#define IO_MUX_GPIO31_MCU_DRV_M  (IO_MUX_GPIO31_MCU_DRV_V << IO_MUX_GPIO31_MCU_DRV_S)
#define IO_MUX_GPIO31_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO31_MCU_DRV_S  5
/** IO_MUX_GPIO31_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO31_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO31_FUN_WPD_M  (IO_MUX_GPIO31_FUN_WPD_V << IO_MUX_GPIO31_FUN_WPD_S)
#define IO_MUX_GPIO31_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO31_FUN_WPD_S  7
/** IO_MUX_GPIO31_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO31_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO31_FUN_WPU_M  (IO_MUX_GPIO31_FUN_WPU_V << IO_MUX_GPIO31_FUN_WPU_S)
#define IO_MUX_GPIO31_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO31_FUN_WPU_S  8
/** IO_MUX_GPIO31_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO31_FUN_IE    (BIT(9))
#define IO_MUX_GPIO31_FUN_IE_M  (IO_MUX_GPIO31_FUN_IE_V << IO_MUX_GPIO31_FUN_IE_S)
#define IO_MUX_GPIO31_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO31_FUN_IE_S  9
/** IO_MUX_GPIO31_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO31_FUN_DRV    0x00000003U
#define IO_MUX_GPIO31_FUN_DRV_M  (IO_MUX_GPIO31_FUN_DRV_V << IO_MUX_GPIO31_FUN_DRV_S)
#define IO_MUX_GPIO31_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO31_FUN_DRV_S  10
/** IO_MUX_GPIO31_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO31_MCU_SEL    0x00000007U
#define IO_MUX_GPIO31_MCU_SEL_M  (IO_MUX_GPIO31_MCU_SEL_V << IO_MUX_GPIO31_MCU_SEL_S)
#define IO_MUX_GPIO31_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO31_MCU_SEL_S  12
/** IO_MUX_GPIO31_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO31_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO31_FILTER_EN_M  (IO_MUX_GPIO31_FILTER_EN_V << IO_MUX_GPIO31_FILTER_EN_S)
#define IO_MUX_GPIO31_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO31_FILTER_EN_S  15

/** IO_MUX_gpio32_REG register
 *  iomux control register for gpio32
 */
#define IO_MUX_GPIO32_REG (DR_REG_IO_MUX_BASE + 0x84)
/** IO_MUX_GPIO32_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO32_MCU_OE    (BIT(0))
#define IO_MUX_GPIO32_MCU_OE_M  (IO_MUX_GPIO32_MCU_OE_V << IO_MUX_GPIO32_MCU_OE_S)
#define IO_MUX_GPIO32_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO32_MCU_OE_S  0
/** IO_MUX_GPIO32_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO32_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO32_SLP_SEL_M  (IO_MUX_GPIO32_SLP_SEL_V << IO_MUX_GPIO32_SLP_SEL_S)
#define IO_MUX_GPIO32_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO32_SLP_SEL_S  1
/** IO_MUX_GPIO32_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO32_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO32_MCU_WPD_M  (IO_MUX_GPIO32_MCU_WPD_V << IO_MUX_GPIO32_MCU_WPD_S)
#define IO_MUX_GPIO32_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO32_MCU_WPD_S  2
/** IO_MUX_GPIO32_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO32_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO32_MCU_WPU_M  (IO_MUX_GPIO32_MCU_WPU_V << IO_MUX_GPIO32_MCU_WPU_S)
#define IO_MUX_GPIO32_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO32_MCU_WPU_S  3
/** IO_MUX_GPIO32_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO32_MCU_IE    (BIT(4))
#define IO_MUX_GPIO32_MCU_IE_M  (IO_MUX_GPIO32_MCU_IE_V << IO_MUX_GPIO32_MCU_IE_S)
#define IO_MUX_GPIO32_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO32_MCU_IE_S  4
/** IO_MUX_GPIO32_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strenth on sleep mode
 */
#define IO_MUX_GPIO32_MCU_DRV    0x00000003U
#define IO_MUX_GPIO32_MCU_DRV_M  (IO_MUX_GPIO32_MCU_DRV_V << IO_MUX_GPIO32_MCU_DRV_S)
#define IO_MUX_GPIO32_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO32_MCU_DRV_S  5
/** IO_MUX_GPIO32_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO32_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO32_FUN_WPD_M  (IO_MUX_GPIO32_FUN_WPD_V << IO_MUX_GPIO32_FUN_WPD_S)
#define IO_MUX_GPIO32_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO32_FUN_WPD_S  7
/** IO_MUX_GPIO32_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO32_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO32_FUN_WPU_M  (IO_MUX_GPIO32_FUN_WPU_V << IO_MUX_GPIO32_FUN_WPU_S)
#define IO_MUX_GPIO32_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO32_FUN_WPU_S  8
/** IO_MUX_GPIO32_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO32_FUN_IE    (BIT(9))
#define IO_MUX_GPIO32_FUN_IE_M  (IO_MUX_GPIO32_FUN_IE_V << IO_MUX_GPIO32_FUN_IE_S)
#define IO_MUX_GPIO32_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO32_FUN_IE_S  9
/** IO_MUX_GPIO32_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO32_FUN_DRV    0x00000003U
#define IO_MUX_GPIO32_FUN_DRV_M  (IO_MUX_GPIO32_FUN_DRV_V << IO_MUX_GPIO32_FUN_DRV_S)
#define IO_MUX_GPIO32_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO32_FUN_DRV_S  10
/** IO_MUX_GPIO32_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO32_MCU_SEL    0x00000007U
#define IO_MUX_GPIO32_MCU_SEL_M  (IO_MUX_GPIO32_MCU_SEL_V << IO_MUX_GPIO32_MCU_SEL_S)
#define IO_MUX_GPIO32_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO32_MCU_SEL_S  12
/** IO_MUX_GPIO32_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO32_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO32_FILTER_EN_M  (IO_MUX_GPIO32_FILTER_EN_V << IO_MUX_GPIO32_FILTER_EN_S)
#define IO_MUX_GPIO32_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO32_FILTER_EN_S  15
/** IO_MUX_GPIO32_RUE_I3C : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define IO_MUX_GPIO32_RUE_I3C    (BIT(16))
#define IO_MUX_GPIO32_RUE_I3C_M  (IO_MUX_GPIO32_RUE_I3C_V << IO_MUX_GPIO32_RUE_I3C_S)
#define IO_MUX_GPIO32_RUE_I3C_V  0x00000001U
#define IO_MUX_GPIO32_RUE_I3C_S  16
/** IO_MUX_GPIO32_RU_I3C : R/W; bitpos: [18:17]; default: 0;
 *  NA
 */
#define IO_MUX_GPIO32_RU_I3C    0x00000003U
#define IO_MUX_GPIO32_RU_I3C_M  (IO_MUX_GPIO32_RU_I3C_V << IO_MUX_GPIO32_RU_I3C_S)
#define IO_MUX_GPIO32_RU_I3C_V  0x00000003U
#define IO_MUX_GPIO32_RU_I3C_S  17
/** IO_MUX_GPIO32_RUE_SEL_I3C : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define IO_MUX_GPIO32_RUE_SEL_I3C    (BIT(19))
#define IO_MUX_GPIO32_RUE_SEL_I3C_M  (IO_MUX_GPIO32_RUE_SEL_I3C_V << IO_MUX_GPIO32_RUE_SEL_I3C_S)
#define IO_MUX_GPIO32_RUE_SEL_I3C_V  0x00000001U
#define IO_MUX_GPIO32_RUE_SEL_I3C_S  19

/** IO_MUX_gpio33_REG register
 *  iomux control register for gpio33
 */
#define IO_MUX_GPIO33_REG (DR_REG_IO_MUX_BASE + 0x88)
/** IO_MUX_GPIO33_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  output enable on sleep mode
 */
#define IO_MUX_GPIO33_MCU_OE    (BIT(0))
#define IO_MUX_GPIO33_MCU_OE_M  (IO_MUX_GPIO33_MCU_OE_V << IO_MUX_GPIO33_MCU_OE_S)
#define IO_MUX_GPIO33_MCU_OE_V  0x00000001U
#define IO_MUX_GPIO33_MCU_OE_S  0
/** IO_MUX_GPIO33_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  io sleep mode enable. set 1 to enable sleep mode.
 */
#define IO_MUX_GPIO33_SLP_SEL    (BIT(1))
#define IO_MUX_GPIO33_SLP_SEL_M  (IO_MUX_GPIO33_SLP_SEL_V << IO_MUX_GPIO33_SLP_SEL_S)
#define IO_MUX_GPIO33_SLP_SEL_V  0x00000001U
#define IO_MUX_GPIO33_SLP_SEL_S  1
/** IO_MUX_GPIO33_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  pull-down enable on sleep mode
 */
#define IO_MUX_GPIO33_MCU_WPD    (BIT(2))
#define IO_MUX_GPIO33_MCU_WPD_M  (IO_MUX_GPIO33_MCU_WPD_V << IO_MUX_GPIO33_MCU_WPD_S)
#define IO_MUX_GPIO33_MCU_WPD_V  0x00000001U
#define IO_MUX_GPIO33_MCU_WPD_S  2
/** IO_MUX_GPIO33_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  pull-up enable on sleep mode
 */
#define IO_MUX_GPIO33_MCU_WPU    (BIT(3))
#define IO_MUX_GPIO33_MCU_WPU_M  (IO_MUX_GPIO33_MCU_WPU_V << IO_MUX_GPIO33_MCU_WPU_S)
#define IO_MUX_GPIO33_MCU_WPU_V  0x00000001U
#define IO_MUX_GPIO33_MCU_WPU_S  3
/** IO_MUX_GPIO33_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  input enable on sleep mode
 */
#define IO_MUX_GPIO33_MCU_IE    (BIT(4))
#define IO_MUX_GPIO33_MCU_IE_M  (IO_MUX_GPIO33_MCU_IE_V << IO_MUX_GPIO33_MCU_IE_S)
#define IO_MUX_GPIO33_MCU_IE_V  0x00000001U
#define IO_MUX_GPIO33_MCU_IE_S  4
/** IO_MUX_GPIO33_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  select drive strenth on sleep mode
 */
#define IO_MUX_GPIO33_MCU_DRV    0x00000003U
#define IO_MUX_GPIO33_MCU_DRV_M  (IO_MUX_GPIO33_MCU_DRV_V << IO_MUX_GPIO33_MCU_DRV_S)
#define IO_MUX_GPIO33_MCU_DRV_V  0x00000003U
#define IO_MUX_GPIO33_MCU_DRV_S  5
/** IO_MUX_GPIO33_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  pull-down enable
 */
#define IO_MUX_GPIO33_FUN_WPD    (BIT(7))
#define IO_MUX_GPIO33_FUN_WPD_M  (IO_MUX_GPIO33_FUN_WPD_V << IO_MUX_GPIO33_FUN_WPD_S)
#define IO_MUX_GPIO33_FUN_WPD_V  0x00000001U
#define IO_MUX_GPIO33_FUN_WPD_S  7
/** IO_MUX_GPIO33_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  pull-up enable
 */
#define IO_MUX_GPIO33_FUN_WPU    (BIT(8))
#define IO_MUX_GPIO33_FUN_WPU_M  (IO_MUX_GPIO33_FUN_WPU_V << IO_MUX_GPIO33_FUN_WPU_S)
#define IO_MUX_GPIO33_FUN_WPU_V  0x00000001U
#define IO_MUX_GPIO33_FUN_WPU_S  8
/** IO_MUX_GPIO33_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  input enable
 */
#define IO_MUX_GPIO33_FUN_IE    (BIT(9))
#define IO_MUX_GPIO33_FUN_IE_M  (IO_MUX_GPIO33_FUN_IE_V << IO_MUX_GPIO33_FUN_IE_S)
#define IO_MUX_GPIO33_FUN_IE_V  0x00000001U
#define IO_MUX_GPIO33_FUN_IE_S  9
/** IO_MUX_GPIO33_FUN_DRV : R/W; bitpos: [11:10]; default: 2;
 *  select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA
 */
#define IO_MUX_GPIO33_FUN_DRV    0x00000003U
#define IO_MUX_GPIO33_FUN_DRV_M  (IO_MUX_GPIO33_FUN_DRV_V << IO_MUX_GPIO33_FUN_DRV_S)
#define IO_MUX_GPIO33_FUN_DRV_V  0x00000003U
#define IO_MUX_GPIO33_FUN_DRV_S  10
/** IO_MUX_GPIO33_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  0:select function0, 1:select function1 ...
 */
#define IO_MUX_GPIO33_MCU_SEL    0x00000007U
#define IO_MUX_GPIO33_MCU_SEL_M  (IO_MUX_GPIO33_MCU_SEL_V << IO_MUX_GPIO33_MCU_SEL_S)
#define IO_MUX_GPIO33_MCU_SEL_V  0x00000007U
#define IO_MUX_GPIO33_MCU_SEL_S  12
/** IO_MUX_GPIO33_FILTER_EN : R/W; bitpos: [15]; default: 0;
 *  input filter enable
 */
#define IO_MUX_GPIO33_FILTER_EN    (BIT(15))
#define IO_MUX_GPIO33_FILTER_EN_M  (IO_MUX_GPIO33_FILTER_EN_V << IO_MUX_GPIO33_FILTER_EN_S)
#define IO_MUX_GPIO33_FILTER_EN_V  0x00000001U
#define IO_MUX_GPIO33_FILTER_EN_S  15
/** IO_MUX_GPIO33_RUE_I3C : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define IO_MUX_GPIO33_RUE_I3C    (BIT(16))
#define IO_MUX_GPIO33_RUE_I3C_M  (IO_MUX_GPIO33_RUE_I3C_V << IO_MUX_GPIO33_RUE_I3C_S)
#define IO_MUX_GPIO33_RUE_I3C_V  0x00000001U
#define IO_MUX_GPIO33_RUE_I3C_S  16
/** IO_MUX_GPIO33_RU_I3C : R/W; bitpos: [18:17]; default: 0;
 *  NA
 */
#define IO_MUX_GPIO33_RU_I3C    0x00000003U
#define IO_MUX_GPIO33_RU_I3C_M  (IO_MUX_GPIO33_RU_I3C_V << IO_MUX_GPIO33_RU_I3C_S)
#define IO_MUX_GPIO33_RU_I3C_V  0x00000003U
#define IO_MUX_GPIO33_RU_I3C_S  17
/** IO_MUX_GPIO33_RUE_SEL_I3C : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define IO_MUX_GPIO33_RUE_SEL_I3C    (BIT(19))
#define IO_MUX_GPIO33_RUE_SEL_I3C_M  (IO_MUX_GPIO33_RUE_SEL_I3C_V << IO_MUX_GPIO33_RUE_SEL_I3C_S)
#define IO_MUX_GPIO33_RUE_SEL_I3C_V  0x00000001U
#define IO_MUX_GPIO33_RUE_SEL_I3C_S  19

